FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_EFM32_Gecko_Starter_Kit_Simplicity_Studio/Source/SilLabs_Code/Device/SiliconLabs/EFM32GG/Include/efm32gg900f1024.h
/** @} End of group EFM32GG900F1024_Peripheral_Declaration */

/**************************************************************************//**
 * @defgroup EFM32GG900F1024_BitFields EFM32GG900F1024 Bit Fields
 * @{
 *****************************************************************************/

#include "efm32gg_prs_signals.h"
#include "efm32gg_dmareq.h"
#include "efm32gg_dmactrl.h"
#include "efm32gg_uart.h"

/**************************************************************************//**
 * @defgroup EFM32GG900F1024_UNLOCK EFM32GG900F1024 Unlock Codes
 * @{
 *****************************************************************************/
#define MSC_UNLOCK_CODE      0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE      0xADE8 /**< EMU unlock code */
#define CMU_UNLOCK_CODE      0x580E /**< CMU unlock code */
#define TIMER_UNLOCK_CODE    0xCE80 /**< TIMER unlock code */
#define GPIO_UNLOCK_CODE     0xA534 /**< GPIO unlock code */
#define BURTC_UNLOCK_CODE    0xAEE8 /**< BURTC unlock code */

/** @} End of group EFM32GG900F1024_UNLOCK */

/** @} End of group EFM32GG900F1024_BitFields */

/**************************************************************************//**
 * @defgroup EFM32GG900F1024_Alternate_Function EFM32GG900F1024 Alternate Function
 * @{
 *****************************************************************************/

#include "efm32gg_af_ports.h"
#include "efm32gg_af_pins.h"

/** @} End of group EFM32GG900F1024_Alternate_Function */

/**************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to update
 *  @param MASK
 *       The mask for the bit field to update
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 *****************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EFM32GG900F1024  */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif
#endif /* __SILICON_LABS_EFM32GG900F1024_H__ */
